const description = [
    {
        title: 'چینی تقدیس',
        text: [
            {
                paragraph: "چینی تقدیس یکی از معتبرترین برندهای ایرانی در زمینه سرویس های چند پارچه است. چینی تقدیس نیز مانند برخی دیگر از تولیدکنندگان چینی سرویس های خود را در کیفیت های مختلف تولید می کند. دسته اول که با نام چینی تقدیس شناخته می شوند، چینی های درجه یک بوده و دارای بالاترین کیفیت هستند."
            },
            {
                paragraph: "دسته دوم به نام چینی پارمیس شناخته می شود که درجه آن 1.5 در نظر گرفته شده است. دسته سوم چینی چینی نفیس است که با وجود کیفیت بالا اما درجه کیفی از دو سطح قبلی پایین تر است و درجه 2 شناخته می شود. مدل و قالب های چینی تقدیس بسیار متنوع است و تعداد پارچه های متفاوتی نیز برای آن در نظر گرفته شده است."
            },
            {
                paragraph: "چینی تقدیس با توجه به نیاز مصرف کنندگان اقدام به تولید چینی های متفاوت با کاربردهای مختلف از جمله سرویس غذاخوری چینی، چینی هتلی و رستورانی، شیرینی خوری، سرویس کودک، پیاله چینی، نعلبکی، پارچ کرده است. در برندهای معتبر چینی مانند تقدیس ویژگی های زیادی برای افزایش کیفیت در نظر گرفته شده است که مقاومت در برابر شوک های حرارتی، مقاومت بالا در برابر ضربه و جلوگیری از لب پر شدن، عدم وجود حباب و درخشندگی بالای چینی از نمونه های آن است."
            },
            {
                paragraph: "اگر نگهداری ظروف چینی مانند چینی تقدیس با اصولی ساده ای مانند عدم شستن چینی با مواد شوینده قوی و وایتکس، شستشوی چینی با اسفنج های نرم و همراه باشد، عمر آن باز هم بیشتر خواهد شد."
            },
        ],
    },
    {
        title: 'سرویس چینی تقدیس',
        text: [
            {
                paragraph: "چینی تقدیس دارای محصولات بسیار زیاد و متنوع با توجه به نیاز مصرف کننده می باشد. چینی تقدیس علاوه بر سرویس و ظروف اصلی مواردی همچون: جا دستمالی ، بشقاب تخت ، گلدان، نمک پاش، زیر سیگاری، گلدان ، جا ادویه ای و... را نیز در خط تولید خود دارد. چینی تقدیس در دو لاین، چینی هتلی و چینی خانگی فعالیت می می کند. "
            },
            {
                paragraph: "چینی تقدیس ظروف چینی خود را در قالب و طرح های بسیار متنوعی روانه بازار کرده است. سرویس 6 و 12 پارچه با اقلام متفاوت جوابگوی نیازهای کلیه افراد است. سرویس های چینی تقدیس اقلام متفاوتی مانند دیس، بشقاب غذاخوری، خورشت خوری، پیش دستی، پیاله و نمک پاش را دارا می باشد."
            },
            {
                paragraph: "چینی تقدیس یکی از برندهای معتبر چینی در بازار است و از فروش خوبی برخوردار است زیرا با توجه به کیفیت، قیمت بسیار مناسب دارد. با توجه به مدل و طرح های چینی تقدیس می توانید گزینه مناسب جهت استفاده روزانه یا مهمانی و مجالس را انتخاب کنید. "
            },
        ]
    },
    {
        title: 'سرویس چینی تقدیس کلاسیک مدیسا طلا 6 نفره 32 پارچه',
        text: [
            {
                paragraph: "سرویس چینی کلاسیک مدیسا طلا از مدل های جدید چینی تقدیس است که در 32 پارچه تولید شده است و برای 6 نفر مناسب می باشد. این سرویس چینی 6 نفره شامل دو سایز بشقاب تخت، بشقاب گود، دو سایز پیاله، یک عدد دیس، سس خوری، نمکپاش و حلقه دستمال است. این سرویس با وجود کیفیت بالا از قیمت مناسب و مقرون به صرفه ای برخوردار است. "
            },
            {
                paragraph: "درخشندگی و شفافیت در مدل چینی مدیسا طلا چینی تقدیس نیز رعایت شده است. این برند چینی در سال 1384 در لاین های چینی خانگی، هتلی و ر ستورانی شروع به فعالیت کرد و با تولید طرح و مدل های جدید و باکیفیت به سرعت مورد استقبال قرار گرفت به شکلی که در حال حاضر یکی از مهم ترین تولید کنندگان چینی در ایران می باشد. "
            },
            {
                paragraph: "طرح مدیسا طلا با نواری طلایی رنگ باریکی در لبه سرویس منقش شده است. طرح هایی که در حاشیه و کف بشقاب طرح شده است، کم رنگ و حالتی محوگونه دارند و مناسب افرادی است که به دنبال طرح هایی با نقوش ساده هستند. گل های سفید رنگ این طرح بر روی پس زمینه طلایی صورتی رنگ ملایم، زیبایی چشمگیری به مدل مدیسا طلا بخشیده است. "
            },
        ]
    }
]

export default function Description({ showComment }) {
    return (
        <>
            {/* <!-- Description --> */}
            <div
                className={`${!showComment ? "flex" : "hidden"} flex-col w-full mt-2.5 p-5 md:p-10 text-sm md:text-base lg:text-lg text-black dark:text-white bg-white dark:bg-zinc-700 shadow-normal rounded-2xl gap-y-6`}>
                {description.map((item, index) => {
                    return <div key={index} className="">
                        <h4 className="font-DanaBold mb-4 text-base md:text-lg lg:text-xl">
                            {item.title}
                        </h4>
                        {item.text.map((text, index) => {
                            return <p key={index} className="mb-4">
                                {text.paragraph}
                            </p>
                        })}
                    </div>
                })}
            </div>
        </>
    )
}
